Revit 2025 API
PlanViewPlane Enumeration
 Locations where view range offsets can be specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PlanViewPlane
Public Enumeration PlanViewPlane
public enum class PlanViewPlane
type PlanViewPlane
Members
Member name | Value | Description
CutPlane | 0 |  Cut Plane
TopClipPlane | 1 |  Top Clip Plane
BottomClipPlane | 2 |  Bottom Clip Plane
ViewDepthPlane | 3 |  View Depth Plane
UnderlayBottom | 4 |  Underlay Bottom Plane
See Also
Reference
Autodesk.Revit.DB Namespace